File.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
<s:Body>
<epos-print xmlns="http://www.epson-pos.com/schemas/2011/03/epos-print">
<text>test</text>
<text>print/n</text>
<cut type="feed"/>
</epos-print>
</s:Body>
</s:Envelope>
